#ifndef _ECP341012_H_
#define _ECP341012_H_

#include "ecp_algebra.h"

/**************************************************************/
//Переменные и массивы
/**************************************************************/

/**************************************************************/
//Константы
/**************************************************************/
#define ECP_FORM			0					//формирование ЭЦП
#define ECP_CONTROL			1					//проверка ЭЦП
#define ECP_FORM_OKEY		2					//формирование открытого ключа проверки ЭЦП

/**************************************************************/
//Структура параметров ЭЦП
/**************************************************************/
typedef struct
{
	unsigned char *P;							//модуль эллиптической кривой
	unsigned char *A;							//коэффициент эллиптической кривой
	unsigned char *B;							//коэффициент эллиптической кривой
	unsigned char *Q;							//порядок циклической подгруппы группы точек эллиптической кривой
	unsigned char *Px;							//х - координата точки эллиптической кривой
	unsigned char *Py;							//y - координата точки эллиптической кривой
} InitEcpStruct;	 

/**************************************************************/
//Основная структура
/**************************************************************/
typedef struct
{
	unsigned short Pr;							//признак (формирование/проверка)
	unsigned char *Hesh;						//хэш
	unsigned char *Skey;						//секретный ключ (используется при формировании)
	unsigned char *Okey;						//открытый ключ (используется при проверке)
	unsigned char *Ecp;							//значение ЭЦП (после формирования или для проверки)
	unsigned char *K;							//случайное число (используется при формировании)
} EcpStruct;	 

/**************************************************************/
//Прототипы функций
/**************************************************************/
extern unsigned short InitEcp341012(InitEcpStruct * Data);
extern unsigned short Ecp341012(EcpStruct * Data);

#endif

