#ifndef _HESH341112_H_
#define _HESH341112_H_

/**************************************************************/
//Переменные и массивы
/**************************************************************/

/**************************************************************/
//Константы
/**************************************************************/
//#define TR_NO			0x00				//не использовать промежуточное состояние
//#define TR_YES			0x01				//использовать промежуточное состояние

#define HESH_LEN_512	0x00				//размер хэш 512 бит
#define HESH_LEN_256	0x01				//размер хэш 256 бит

/**************************************************************/
//Основная структура
/**************************************************************/
typedef struct
	{
	unsigned char * Data;					//исходные данные
	unsigned char * Hesh;					//хэш на исходные данные
	unsigned int   DataLen;				//размер исходных данных в байтах
	unsigned short  STATE;					//работа с промежуточным состоянием
	} HeshStruct;	 

/**************************************************************/
//Прототипы функций
/**************************************************************/
extern unsigned short Hesh341112(unsigned int HeshLen, HeshStruct * Data);

#endif


